Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/GD32VF103/Includes/soc_reg.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; GD32VF103.
; ==========

;------------------------------------------------------------------------
; Project: uKOS-X
;
; Purpose:
;   GD32VF103 equates.
;
; Description:
;    Generated using the .svd description
;
;-----
;------------------------------------------------------------------------
*/

#pragma once

// Some includes are not necessary because
// addendum contains the skipped definitions.

#define     KDEFINED_IN_ADDENDUM_S

// IWYU pragma: begin_exports

#include    "Registers/soc_vectors.h"
#include    "Registers/GD32VF103_adc0.h"
#include    "Registers/GD32VF103_adc1.h"
#include    "Registers/GD32VF103_afio.h"
#include    "Registers/GD32VF103_bkp.h"
#include    "Registers/GD32VF103_can.h"
#include    "Registers/GD32VF103_crc.h"
#include    "Registers/GD32VF103_dac.h"
#include    "Registers/GD32VF103_dbg.h"
#include    "Registers/GD32VF103_dma0.h"
#include    "Registers/GD32VF103_dma1.h"

#ifndef KDEFINED_IN_ADDENDUM_S
#include    "Registers/GD32VF103_eclic.h"
#endif

#include    "Registers/GD32VF103_exmc.h"
#include    "Registers/GD32VF103_exti.h"
#include    "Registers/GD32VF103_fmc.h"
#include    "Registers/GD32VF103_fwdgt.h"
#include    "Registers/GD32VF103_gpio.h"
#include    "Registers/GD32VF103_i2c.h"
#include    "Registers/GD32VF103_pmu.h"
#include    "Registers/GD32VF103_rcu.h"
#include    "Registers/GD32VF103_rtc.h"
#include    "Registers/GD32VF103_spi.h"
#include    "Registers/GD32VF103_timer0.h"
#include    "Registers/GD32VF103_timer1.h"
#include    "Registers/GD32VF103_timer2.h"
#include    "Registers/GD32VF103_timer3.h"
#include    "Registers/GD32VF103_timer4.h"
#include    "Registers/GD32VF103_timer5.h"
#include    "Registers/GD32VF103_timer6.h"
#include    "Registers/GD32VF103_uart.h"
#include    "Registers/GD32VF103_usart.h"
#include    "Registers/GD32VF103_usbfs_device.h"
#include    "Registers/GD32VF103_usbfs_global.h"
#include    "Registers/GD32VF103_usbfs_host.h"
#include    "Registers/GD32VF103_usbfs_pwrclk.h"
#include    "Registers/GD32VF103_wwdgt.h"
#include    "Registers/soc_addendum.h"

// IWYU pragma: end_exports
